Tekla.Structures.DirectManipulation.Adapter.Interaction.NumericInputAxisPrefixConvertor
The Tekla.Structures.DirectManipulation.Adapter.Interaction.NumericInputAxisPrefixConvertor class provides the conversion extension methods
between the Tekla.BIM.DirectManipulation.Services.Interaction.NumericAxisPrefix and Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericAxisPrefix types.

Tekla.Structures.DirectManipulation.Adapter.Interaction.NumericInputAxisPrefixConvertor.Convert(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericAxisPrefix)
Converts a value of Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericAxisPrefix to a value of Tekla.BIM.DirectManipulation.Services.Interaction.NumericAxisPrefix.
prefixes: The value to convert.
Returns: The converted Tekla.BIM.DirectManipulation.Services.Interaction.NumericAxisPrefix value.

Tekla.Structures.DirectManipulation.Adapter.Interaction.NumericInputAxisPrefixConvertor.Convert(Tekla.BIM.DirectManipulation.Services.Interaction.NumericAxisPrefix)
Converts a value of Tekla.BIM.DirectManipulation.Services.Interaction.NumericAxisPrefix to a value of Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericAxisPrefix.
prefixes: The value to convert.
Returns: The converted Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericAxisPrefix value.